In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv("stud.csv")

In [3]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
df.shape

(1000, 8)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race_ethnicity               1000 non-null   object
 2   parental_level_of_education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test_preparation_course      1000 non-null   object
 5   math_score                   1000 non-null   int64
 6   reading_score                1000 non-null   int64
 7   writing_score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [7]:
df.describe()

       math_score  reading_score  writing_score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [8]:
# data missing
df.isna().sum()

gender                         0
race_ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

# checking duplicate

In [13]:
df.duplicated().sum()

0

### There isno duplicate values

# checking uniques values in each columns

In [15]:
df.nunique()

gender                          2
race_ethnicity                  5
parental_level_of_education     6
lunch                           2
test_preparation_course         2
math_score                     81
reading_score                  72
writing_score                  77
dtype: int64

# seprating categorical and numerical columns

In [45]:
numerical_features = [colns for colns in df.columns if df[colns].dtype!="O"]
categorical_features = [colns for colns in df.columns if df[colns].dtype=="O"]

In [46]:
print("Numerical features = ",numerical_features)
print("categorical features = ",categorical_features)

Numerical features =  ['math_score', 'reading_score', 'writing_score']
categorical features =  ['gender', 'race_ethnicity', 'parental_level_of_education', 'lunch', 'test_preparation_course']

In [47]:
for colns in categorical_features:
    print("<<<<<<",colns.upper(),">>>>>>>")
    print(df[colns].unique(),"\n")
    
    print(df[colns].value_counts())
    print("====================================\n\n")

<<<<<< GENDER >>>>>>>
['female' 'male']

female    518
male      482
Name: gender, dtype: int64
====================================


<<<<<< RACE_ETHNICITY >>>>>>>
['group B' 'group C' 'group A' 'group D' 'group E']

group C    319
group D    262
group B    190
group E    140
group A     89
Name: race_ethnicity, dtype: int64
====================================


<<<<<< PARENTAL_LEVEL_OF_EDUCATION >>>>>>>
["bachelor's degree" 'some college' "master's degree" "associate's degree"
 'high school' 'some high school']

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental_level_of_education, dtype: int64
====================================


<<<<<< LUNCH >>>>>>>
['standard' 'free/reduced']

standard        645
free/reduced    355
Name: lunch, dtype: int64
====================================


<<<<<< TEST_PREPARATION_COURSE >>>>>>>
['none' 'completed']

none         642
completed    358
Name: test_preparation_course, dtype: int64
====================================

# Adding new columns "total_score" and "Average"

In [55]:
df["total_score"]  = df["math_score"] + df['reading_score'] + df['writing_score']
df["average"] = df["total_score"] / 3

In [56]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total_score,average
0,female,group B,bachelor's degree,standard,none,72,72,74,218,72.666667
1,female,group C,some college,standard,completed,69,90,88,247,82.333333
2,female,group B,master's degree,standard,none,90,95,93,278,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,49.333333
4,male,group C,some college,standard,none,76,78,75,229,76.333333

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64